package homework_1;

/*
Написать приложение, которое будет вычислять и выводить значение по формуле: a=4*(b+c-1)/2;
b и c задаем в коде самостоятельно.
 */

public class Homework_1_1 {
    public static void main(String[] args) {
        int a, b = 2, c = 22;
        a = 4 * (b + c - 1) / 2;
        System.out.println(a);
    }
}
